ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151fxx_cm4.h
/*
 * @brief DDRPERFM block description (DDRPERFM)
 */
typedef struct
{
  __IO uint32_t CTL;             /*!< DDRPERFM control register                Address offset: 0x000 */
  __IO uint32_t CFG;             /*!< DDRPERFM configurationl register         Address offset: 0x004 */
  __IO uint32_t STATUS;          /*!< DDRPERFM status register                 Address offset: 0x008 */
  __IO uint32_t CCR;             /*!< DDRPERFM counter clear register          Address offset: 0x00C */
  __IO uint32_t IER;             /*!< DDRPERFM interrupt enable register       Address offset: 0x010 */
  __IO uint32_t ISR;             /*!< DDRPERFM interrupt status register       Address offset: 0x014 */
  __IO uint32_t ICR;             /*!< DDRPERFM interrupt clear register        Address offset: 0x018 */
       uint32_t RESERVED0;       /*!< Reserved                                 Address offset: 0x01C */
  __IO uint32_t TCNT;            /*!< DDRPERFM time counter register           Address offset: 0x020 */
       uint32_t RESERVED1[3];    /*!< Reserved                                 Address offset: 0x024-0x02C */
  __IO uint32_t CNT0;            /*!< DDRPERFM event counter 0 register        Address offset: 0x030 */
       uint32_t RESERVED2;       /*!< Reserved                                 Address offset: 0x034 */
  __IO uint32_t CNT1;            /*!< DDRPERFM event counter 1 register        Address offset: 0x038 */
       uint32_t RESERVED3;       /*!< Reserved                                 Address offset: 0x03C */
  __IO uint32_t CNT2;            /*!< DDRPERFM event counter 2 register        Address offset: 0x040 */
       uint32_t RESERVED4;       /*!< Reserved                                 Address offset: 0x044 */
  __IO uint32_t CNT3;            /*!< DDRPERFM event counter 3 register        Address offset: 0x048 */
       uint32_t RESERVED5[233];  /*!< Reserved                                 Address offset: 0x04C-0x3EC */
  __IO uint32_t HWCFG;           /*!< DDRPERFM hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VER;             /*!< DDRPERFM version register                Address offset: 0x3F4 */
  __IO uint32_t ID;              /*!< DDRPERFM ID register                     Address offset: 0x3F8 */
  __IO uint32_t SID;             /*!< DDRPERFM magic ID register               Address offset: 0x3FC */
} DDRPERFM_TypeDef;

/*
 * @brief DDRPHYC block description (DDRPHYC)
 */
typedef struct
{
  __IO uint32_t RIDR;           /*!< DDRPHYC revision ID register         Address offset: 0x000 */
  __IO uint32_t PIR;            /*!< DDRPHYC PHY initialization register  Address offset: 0x004 */
  __IO uint32_t PGCR;           /*!< DDRPHYC PHY global control register  Address offset: 0x008 */
  __IO uint32_t PGSR;           /*!< DDRPHYC PHY global status register   Address offset: 0x00C */
  __IO uint32_t DLLGCR;         /*!< DDRPHYC DDR global control register  Address offset: 0x010 */
  __IO uint32_t ACDLLCR;        /*!< DDRPHYC AC DLL control register      Address offset: 0x014 */
  __IO uint32_t PTR0;           /*!< DDRPHYC PT register 0                Address offset: 0x018 */
  __IO uint32_t PTR1;           /*!< DDRPHYC PT register 1                Address offset: 0x01C */
  __IO uint32_t PTR2;           /*!< DDRPHYC PT register 2                Address offset: 0x020 */
  __IO uint32_t ACIOCR;         /*!< DDRPHYC ACIOC register               Address offset: 0x024 */
  __IO uint32_t DXCCR;          /*!< DDRPHYC DXCC register                Address offset: 0x028 */
  __IO uint32_t DSGCR;          /*!< DDRPHYC DSGC register                Address offset: 0x02C */
  __IO uint32_t DCR;            /*!< DDRPHYC DC register                  Address offset: 0x030 */
  __IO uint32_t DTPR0;          /*!< DDRPHYC DTP register 0               Address offset: 0x034 */
  __IO uint32_t DTPR1;          /*!< DDRPHYC DTP register 1               Address offset: 0x038 */
  __IO uint32_t DTPR2;          /*!< DDRPHYC DTP register 2               Address offset: 0x03C */
  __IO uint32_t DDR3_MR0;       /*!< DDRPHYC MR0 register for DDR3        Address offset: 0x040 */
  __IO uint32_t DDR3_MR1;       /*!< DDRPHYC MR1 register for DDR3        Address offset: 0x044 */
  __IO uint32_t DDR3_MR2;       /*!< DDRPHYC MR2 register for DDR3        Address offset: 0x048 */
  __IO uint32_t DDR3_MR3;       /*!< DDRPHYC MR3 register for DDR3        Address offset: 0x04C */
  __IO uint32_t ODTCR;          /*!< DDRPHYC ODTC register                Address offset: 0x050 */
  __IO uint32_t DTAR;           /*!< DDRPHYC DTA register                 Address offset: 0x054 */
  __IO uint32_t DTDR0;          /*!< DDRPHYC DTD register 0               Address offset: 0x058 */
  __IO uint32_t DTDR1;          /*!< DDRPHYC DTD register 1               Address offset: 0x05C */
       uint32_t RESERVED0[70];  /*!< Reserved                             Address offset: 0x060-0x174 */
  __IO uint32_t GPR0;           /*!< DDRPHYC general purpose register 0   Address offset: 0x178 */
  __IO uint32_t GPR1;           /*!< DDRPHYC general purpose register 1   Address offset: 0x17C */
  __IO uint32_t ZQ0CR0;         /*!< DDRPHYC ZQ0C register 0              Address offset: 0x180 */
  __IO uint32_t ZQ0CR1;         /*!< DDRPHYC ZQ0CR1 register              Address offset: 0x184 */
  __IO uint32_t ZQ0SR0;         /*!< DDRPHYC ZQ0S register 0              Address offset: 0x188 */
  __IO uint32_t ZQ0SR1;         /*!< DDRPHYC ZQ0S register 1              Address offset: 0x18C */
       uint32_t RESERVED1[12];  /*!< Reserved                             Address offset: 0x190-0x1BC */
  __IO uint32_t DX0GCR;         /*!< DDRPHYC byte lane 0 GC register      Address offset: 0x1C0 */
  __IO uint32_t DX0GSR0;        /*!< DDRPHYC byte lane 0 GS register 0    Address offset: 0x1C4 */
  __IO uint32_t DX0GSR1;        /*!< DDRPHYC byte lane 0 GS register 1    Address offset: 0x1C8 */
  __IO uint32_t DX0DLLCR;       /*!< DDRPHYC byte lane 0 DLLC register    Address offset: 0x1CC */
  __IO uint32_t DX0DQTR;        /*!< DDRPHYC byte lane 0 DQT register     Address offset: 0x1D0 */
  __IO uint32_t DX0DQSTR;       /*!< DDRPHYC byte lane 0 DQST register    Address offset: 0x1D4 */
       uint32_t RESERVED2[10];  /*!< Reserved                             Address offset: 0x1D8-0x1FC */
  __IO uint32_t DX1GCR;         /*!< DDRPHYC byte lane 1 GC register      Address offset: 0x200 */
  __IO uint32_t DX1GSR0;        /*!< DDRPHYC byte lane 1 GS register 0    Address offset: 0x204 */
  __IO uint32_t DX1GSR1;        /*!< DDRPHYC byte lane 1 GS register 1    Address offset: 0x208 */
  __IO uint32_t DX1DLLCR;       /*!< DDRPHYC byte lane 1 DLLC register    Address offset: 0x20C */
  __IO uint32_t DX1DQTR;        /*!< DDRPHYC byte lane 1 DQT register     Address offset: 0x210 */
  __IO uint32_t DX1DQSTR;       /*!< DDRPHYC byte lane 1 DQST register    Address offset: 0x214 */
       uint32_t RESERVED3[10];  /*!< Reserved                             Address offset: 0x218-0x23C */
  __IO uint32_t DX2GCR;         /*!< DDRPHYC byte lane 2 GC register      Address offset: 0x240 */
  __IO uint32_t DX2GSR0;        /*!< DDRPHYC byte lane 2 GS register 0    Address offset: 0x244 */
  __IO uint32_t DX2GSR1;        /*!< DDRPHYC byte lane 2 GS register 1    Address offset: 0x248 */
  __IO uint32_t DX2DLLCR;       /*!< DDRPHYC byte lane 2 DLLC register    Address offset: 0x24C */
  __IO uint32_t DX2DQTR;        /*!< DDRPHYC byte lane 2 DQT register     Address offset: 0x250 */
  __IO uint32_t DX2DQSTR;       /*!< DDRPHYC byte lane 2 DQST register    Address offset: 0x254 */
       uint32_t RESERVED4[10];  /*!< Reserved                             Address offset: 0x258-0x27C */
  __IO uint32_t DX3GCR;         /*!< DDRPHYC byte lane 3 GC register      Address offset: 0x280 */
  __IO uint32_t DX3GSR0;        /*!< DDRPHYC byte lane 3 GS register 0    Address offset: 0x284 */
  __IO uint32_t DX3GSR1;        /*!< DDRPHYC byte lane 3 GS register 1    Address offset: 0x288 */
  __IO uint32_t DX3DLLCR;       /*!< DDRPHYC byte lane 3 DLLC register    Address offset: 0x28C */
  __IO uint32_t DX3DQTR;        /*!< DDRPHYC byte lane 3 DQT register     Address offset: 0x290 */
  __IO uint32_t DX3DQSTR;       /*!< DDRPHYC byte lane 3 DQST register    Address offset: 0x294 */
} DDRPHYC_TypeDef;

/**
  * @brief DFSDM module registers
  */
typedef struct
{
  __IO uint32_t FLTCR1;      /*!< DFSDM control register1,                          Address offset: 0x100 */
  __IO uint32_t FLTCR2;      /*!< DFSDM control register2,                          Address offset: 0x104 */
  __IO uint32_t FLTISR;      /*!< DFSDM interrupt and status register,              Address offset: 0x108 */
  __IO uint32_t FLTICR;      /*!< DFSDM interrupt flag clear register,              Address offset: 0x10C */
  __IO uint32_t FLTJCHGR;    /*!< DFSDM injected channel group selection register,  Address offset: 0x110 */
  __IO uint32_t FLTFCR;      /*!< DFSDM filter control register,                    Address offset: 0x114 */
  __IO uint32_t FLTJDATAR;   /*!< DFSDM data register for injected group,           Address offset: 0x118 */
  __IO uint32_t FLTRDATAR;   /*!< DFSDM data register for regular group,            Address offset: 0x11C */
  __IO uint32_t FLTAWHTR;    /*!< DFSDM analog watchdog high threshold register,    Address offset: 0x120 */
  __IO uint32_t FLTAWLTR;    /*!< DFSDM analog watchdog low threshold register,     Address offset: 0x124 */
  __IO uint32_t FLTAWSR;     /*!< DFSDM analog watchdog status register             Address offset: 0x128 */
  __IO uint32_t FLTAWCFR;    /*!< DFSDM analog watchdog clear flag register         Address offset: 0x12C */
  __IO uint32_t FLTEXMAX;    /*!< DFSDM extreme detector maximum register,          Address offset: 0x130 */
  __IO uint32_t FLTEXMIN;    /*!< DFSDM extreme detector minimum register           Address offset: 0x134 */
  __IO uint32_t FLTCNVTIMR;  /*!< DFSDM conversion timer,                           Address offset: 0x138 */
} DFSDM_Filter_TypeDef;

/**
  * @brief DFSDM channel configuration registers
  */
typedef struct
{
  __IO uint32_t CHCFGR1;     /*!< DFSDM channel configuration register1,            Address offset: 0x00 */
  __IO uint32_t CHCFGR2;     /*!< DFSDM channel configuration register2,            Address offset: 0x04 */
  __IO uint32_t CHAWSCDR;    /*!< DFSDM channel analog watchdog and
                                  short circuit detector register,                  Address offset: 0x08 */
  __IO uint32_t CHWDATAR;    /*!< DFSDM channel watchdog filter data register,      Address offset: 0x0C */
  __IO uint32_t CHDATINR;    /*!< DFSDM channel data input register,                Address offset: 0x10 */
  __IO uint32_t CHDLYR;      /*!< DFSDM channel delay register,                     Address offset: 0x14 */
} DFSDM_Channel_TypeDef;


/**
  * @brief DFSDM registers
  */
typedef struct
{
  uint32_t RESERVED[508];/*!< Reserved,                                       0x000 - 0x7F0 */
  __IO uint32_t HWCFGR;  /*!< DFSDM HW Configuration register ,       Address offset: 0x7F0 */
  __IO uint32_t VERR;    /*!< DFSDM Version register,                 Address offset: 0x7F4 */
  __IO uint32_t IPDR;    /*!< DFSDM Identification register,          Address offset: 0x7F8 */
  __IO uint32_t SIDR;    /*!< DFSDM Size Identification register,     Address offset: 0x7FC */
} DFSDM_TypeDef;


/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t IDCODE;        /*!< MCU device ID code,                         Address offset: 0x00 */
  __IO uint32_t CR;            /*!< Debug MCU configuration register,           Address offset: 0x04 */
  __IO uint32_t RESERVED4[9];  /*!< Reserved,                                   Address offset: 0x08 */
  __IO uint32_t APB4FZ1;       /*!< Debug MCU APB4FZ1 freeze register CPU1,     Address offset: 0x2C */
  __IO uint32_t APB4FZ2;       /*!< Debug MCU APB4FZ2 freeze register CPU2,     Address offset: 0x30 */
  __IO uint32_t APB1FZ1;       /*!< Debug MCU APB1FZ1 freeze register CPU1,     Address offset: 0x34 */
  __IO uint32_t APB1FZ2;       /*!< Debug MCU APB1FZ2 freeze register CPU2,     Address offset: 0x38 */
  __IO uint32_t APB2FZ1;       /*!< Debug MCU APB2FZ1 freeze register CPU1,     Address offset: 0x3C */
  __IO uint32_t APB2FZ2;       /*!< Debug MCU APB2FZ2 freeze register CPU2,     Address offset: 0x40 */
  __IO uint32_t APB3FZ1;       /*!< Debug MCU APB3FZ1 freeze register CPU1,     Address offset: 0x44 */
  __IO uint32_t APB3FZ2;       /*!< Debug MCU APB3FZ2 freeze register CPU2,     Address offset: 0x48 */
  __IO uint32_t APB5FZ1;       /*!< Debug MCU APB5FZ1 freeze register CPU1,     Address offset: 0x4C */
  __IO uint32_t APB5FZ2;       /*!< Debug MCU APB5FZ2 freeze register CPU2,     Address offset: 0x50 */
}DBGMCU_TypeDef;

/**
  * @brief DCMI
  */

typedef struct
{
  __IO uint32_t CR;       /*!< DCMI control register 1,                       Address offset: 0x000 */
  __IO uint32_t SR;       /*!< DCMI status register,                          Address offset: 0x004 */
  __IO uint32_t RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x008 */
  __IO uint32_t IER;      /*!< DCMI interrupt enable register,                Address offset: 0x00C */
  __IO uint32_t MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x010 */
  __IO uint32_t ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x014 */
  __IO uint32_t ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x018 */
  __IO uint32_t ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x01C */
  __IO uint32_t CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x020 */
  __IO uint32_t CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x024 */
  __IO uint32_t DR;       /*!< DCMI data register,                            Address offset: 0x028 */
  uint32_t RESERVED[242]; /*!< Reserved,                                              0x02C - 0x3F0 */
  __IO uint32_t VERR;     /*!< DCMI Version register,                         Address offset: 0x3F4 */
  __IO uint32_t IPDR;     /*!< DCMI Identification register,                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;     /*!< DCMI Size Identification register,             Address offset: 0x3FC */
} DCMI_TypeDef;

/**
  * @brief DMA Controller
  */

typedef struct
{
  __IO uint32_t CR;     /*!< DMA stream x configuration register      */
  __IO uint32_t NDTR;   /*!< DMA stream x number of data register     */
  __IO uint32_t PAR;    /*!< DMA stream x peripheral address register */
  __IO uint32_t M0AR;   /*!< DMA stream x memory 0 address register   */
  __IO uint32_t M1AR;   /*!< DMA stream x memory 1 address register   */
  __IO uint32_t FCR;    /*!< DMA stream x FIFO control register       */
} DMA_Stream_TypeDef;

typedef struct
{
  __IO uint32_t LISR;   /*!< DMA low interrupt status register,      Address offset: 0x00 */
  __IO uint32_t HISR;   /*!< DMA high interrupt status register,     Address offset: 0x04 */
  __IO uint32_t LIFCR;  /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
  __IO uint32_t HIFCR;  /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
  __IO uint32_t RESERVED[247];  /*!< Reserved,               Address offset: 0x10 - 0x3E8 */
  __IO uint32_t HWCFGR2; /*!< DMA HW Configuration register 2,      Address offset: 0x3EC */
  __IO uint32_t HWCFGR1; /*!< DMA HW Configuration register 1,      Address offset: 0x3F0 */
  __IO uint32_t VERR;    /*!< DMA Version register,                 Address offset: 0x3F4 */
  __IO uint32_t IPDR;    /*!< DMA Identification register,          Address offset: 0x3F8 */
  __IO uint32_t SIDR;    /*!< DMA Size Identification register,     Address offset: 0x3FC */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t  CCR;        /*!< DMA Multiplexer Channel x Control Register   */
}DMAMUX_Channel_TypeDef;

typedef struct
{
  __IO uint32_t  CSR;      /*!< DMA Channel Status Register     */
  __IO uint32_t  CFR;      /*!< DMA Channel Clear Flag Register */
}DMAMUX_ChannelStatus_TypeDef;

typedef struct
{
  __IO uint32_t  RGCR;        /*!< DMA Request Generator x Control Register   */
}DMAMUX_RequestGen_TypeDef;

typedef struct
{
  __IO uint32_t  RGSR;            /*!< DMAMUX Request Generator Status Register,           Address offset: 0x140 */
  __IO uint32_t  RGCFR;           /*!< DMAMUX Request Generator Clear Flag Register,       Address offset: 0x144 */
  uint32_t       RESERVED0[169];  /*!< Reserved, 0x144 -> 0x144                                                  */
  __IO uint32_t  HWCFGR2;         /*!< DMAMUX Configuration register 2,                    Address offset: 0x3EC */
  __IO uint32_t  HWCFGR1;         /*!< DMAMUX Configuration register 1,                    Address offset: 0x3F0 */
  __IO uint32_t  VERR;            /*!< DMAMUX Verion Register,                             Address offset: 0x3F4 */
  __IO uint32_t  IPDR;            /*!< DMAMUX Identification register,                     Address offset: 0x3F8 */
  __IO uint32_t  SIDR;            /*!< DMAMUX Size Identification register,                Address offset: 0x3FC */

