ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151fxx_cm4.h
/*************  Bit definition for RCC_MP_AHB6LPENCLRR register  **************/
#define RCC_MP_AHB6LPENCLRR_MDMALPEN_Pos          (0U)
#define RCC_MP_AHB6LPENCLRR_MDMALPEN_Msk          (0x1U << RCC_MP_AHB6LPENCLRR_MDMALPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_AHB6LPENCLRR_MDMALPEN              RCC_MP_AHB6LPENCLRR_MDMALPEN_Msk                   /*!< MDMA peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_GPULPEN_Pos           (5U)
#define RCC_MP_AHB6LPENCLRR_GPULPEN_Msk           (0x1U << RCC_MP_AHB6LPENCLRR_GPULPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_AHB6LPENCLRR_GPULPEN               RCC_MP_AHB6LPENCLRR_GPULPEN_Msk                    /*!< GPU peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_ETHCKLPEN_Pos         (7U)
#define RCC_MP_AHB6LPENCLRR_ETHCKLPEN_Msk         (0x1U << RCC_MP_AHB6LPENCLRR_ETHCKLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MP_AHB6LPENCLRR_ETHCKLPEN             RCC_MP_AHB6LPENCLRR_ETHCKLPEN_Msk                  /*!< Disable of the Ethernet clock generated by the RCC (eth_ker_ck) during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_ETHTXLPEN_Pos         (8U)
#define RCC_MP_AHB6LPENCLRR_ETHTXLPEN_Msk         (0x1U << RCC_MP_AHB6LPENCLRR_ETHTXLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_AHB6LPENCLRR_ETHTXLPEN             RCC_MP_AHB6LPENCLRR_ETHTXLPEN_Msk                  /*!< Disable of the Ethernet Transmission Clock during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_ETHRXLPEN_Pos         (9U)
#define RCC_MP_AHB6LPENCLRR_ETHRXLPEN_Msk         (0x1U << RCC_MP_AHB6LPENCLRR_ETHRXLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MP_AHB6LPENCLRR_ETHRXLPEN             RCC_MP_AHB6LPENCLRR_ETHRXLPEN_Msk                  /*!< Disable of the Ethernet Reception Clock during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_ETHMACLPEN_Pos        (10U)
#define RCC_MP_AHB6LPENCLRR_ETHMACLPEN_Msk        (0x1U << RCC_MP_AHB6LPENCLRR_ETHMACLPEN_Pos)       /*!< 0x00000400 */
#define RCC_MP_AHB6LPENCLRR_ETHMACLPEN            RCC_MP_AHB6LPENCLRR_ETHMACLPEN_Msk                 /*!< Disable of the bus interface clocks for ETH block during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_ETHSTPEN_Pos          (11U)
#define RCC_MP_AHB6LPENCLRR_ETHSTPEN_Msk          (0x1U << RCC_MP_AHB6LPENCLRR_ETHSTPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_AHB6LPENCLRR_ETHSTPEN              RCC_MP_AHB6LPENCLRR_ETHSTPEN_Msk                   /*!< ETH peripheral clock enable during CStop mode */
#define RCC_MP_AHB6LPENCLRR_FMCLPEN_Pos           (12U)
#define RCC_MP_AHB6LPENCLRR_FMCLPEN_Msk           (0x1U << RCC_MP_AHB6LPENCLRR_FMCLPEN_Pos)          /*!< 0x00001000 */
#define RCC_MP_AHB6LPENCLRR_FMCLPEN               RCC_MP_AHB6LPENCLRR_FMCLPEN_Msk                    /*!< FMC peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_QSPILPEN_Pos          (14U)
#define RCC_MP_AHB6LPENCLRR_QSPILPEN_Msk          (0x1U << RCC_MP_AHB6LPENCLRR_QSPILPEN_Pos)         /*!< 0x00004000 */
#define RCC_MP_AHB6LPENCLRR_QSPILPEN              RCC_MP_AHB6LPENCLRR_QSPILPEN_Msk                   /*!< QUADSPI peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_SDMMC1LPEN_Pos        (16U)
#define RCC_MP_AHB6LPENCLRR_SDMMC1LPEN_Msk        (0x1U << RCC_MP_AHB6LPENCLRR_SDMMC1LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MP_AHB6LPENCLRR_SDMMC1LPEN            RCC_MP_AHB6LPENCLRR_SDMMC1LPEN_Msk                 /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_SDMMC2LPEN_Pos        (17U)
#define RCC_MP_AHB6LPENCLRR_SDMMC2LPEN_Msk        (0x1U << RCC_MP_AHB6LPENCLRR_SDMMC2LPEN_Pos)       /*!< 0x00020000 */
#define RCC_MP_AHB6LPENCLRR_SDMMC2LPEN            RCC_MP_AHB6LPENCLRR_SDMMC2LPEN_Msk                 /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_CRC1LPEN_Pos          (20U)
#define RCC_MP_AHB6LPENCLRR_CRC1LPEN_Msk          (0x1U << RCC_MP_AHB6LPENCLRR_CRC1LPEN_Pos)         /*!< 0x00100000 */
#define RCC_MP_AHB6LPENCLRR_CRC1LPEN              RCC_MP_AHB6LPENCLRR_CRC1LPEN_Msk                   /*!< CRC1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENCLRR_USBHLPEN_Pos          (24U)
#define RCC_MP_AHB6LPENCLRR_USBHLPEN_Msk          (0x1U << RCC_MP_AHB6LPENCLRR_USBHLPEN_Pos)         /*!< 0x01000000 */
#define RCC_MP_AHB6LPENCLRR_USBHLPEN              RCC_MP_AHB6LPENCLRR_USBHLPEN_Msk                   /*!< USBH peripheral clocks enable during CSleep mode */

/************  Bit definition for RCC_MP_TZAHB6LPENSETR register  *************/
#define RCC_MP_TZAHB6LPENSETR_MDMALPEN_Pos        (0U)
#define RCC_MP_TZAHB6LPENSETR_MDMALPEN_Msk        (0x1U << RCC_MP_TZAHB6LPENSETR_MDMALPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_TZAHB6LPENSETR_MDMALPEN            RCC_MP_TZAHB6LPENSETR_MDMALPEN_Msk                 /*!< MDMA peripheral clocks enable during CSleep mode */

/************  Bit definition for RCC_MP_TZAHB6LPENCLRR register  *************/
#define RCC_MP_TZAHB6LPENCLRR_MDMALPEN_Pos        (0U)
#define RCC_MP_TZAHB6LPENCLRR_MDMALPEN_Msk        (0x1U << RCC_MP_TZAHB6LPENCLRR_MDMALPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_TZAHB6LPENCLRR_MDMALPEN            RCC_MP_TZAHB6LPENCLRR_MDMALPEN_Msk                 /*!< MDMA peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_APB4LPENSETR register  **************/
#define RCC_MC_APB4LPENSETR_LTDCLPEN_Pos          (0U)
#define RCC_MC_APB4LPENSETR_LTDCLPEN_Msk          (0x1U << RCC_MC_APB4LPENSETR_LTDCLPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_APB4LPENSETR_LTDCLPEN              RCC_MC_APB4LPENSETR_LTDCLPEN_Msk                   /*!< LTDC peripheral clocks enable during CSleep mode */
#define RCC_MC_APB4LPENSETR_DSILPEN_Pos           (4U)
#define RCC_MC_APB4LPENSETR_DSILPEN_Msk           (0x1U << RCC_MC_APB4LPENSETR_DSILPEN_Pos)          /*!< 0x00000010 */
#define RCC_MC_APB4LPENSETR_DSILPEN               RCC_MC_APB4LPENSETR_DSILPEN_Msk                    /*!< DSI peripheral clocks enable during CSleep mode */
#define RCC_MC_APB4LPENSETR_DDRPERFMLPEN_Pos      (8U)
#define RCC_MC_APB4LPENSETR_DDRPERFMLPEN_Msk      (0x1U << RCC_MC_APB4LPENSETR_DDRPERFMLPEN_Pos)     /*!< 0x00000100 */
#define RCC_MC_APB4LPENSETR_DDRPERFMLPEN          RCC_MC_APB4LPENSETR_DDRPERFMLPEN_Msk               /*!< DDRPERFM APB clock enable during CSleep mode */
#define RCC_MC_APB4LPENSETR_USBPHYLPEN_Pos        (16U)
#define RCC_MC_APB4LPENSETR_USBPHYLPEN_Msk        (0x1U << RCC_MC_APB4LPENSETR_USBPHYLPEN_Pos)       /*!< 0x00010000 */
#define RCC_MC_APB4LPENSETR_USBPHYLPEN            RCC_MC_APB4LPENSETR_USBPHYLPEN_Msk                 /*!< USBPHYC peripheral clocks enable during CSleep mode */
#define RCC_MC_APB4LPENSETR_STGENROLPEN_Pos       (20U)
#define RCC_MC_APB4LPENSETR_STGENROLPEN_Msk       (0x1U << RCC_MC_APB4LPENSETR_STGENROLPEN_Pos)      /*!< 0x00100000 */
#define RCC_MC_APB4LPENSETR_STGENROLPEN           RCC_MC_APB4LPENSETR_STGENROLPEN_Msk                /*!< STGEN Read-Only Interface peripheral clocks enable during CSleep mode */
#define RCC_MC_APB4LPENSETR_STGENROSTPEN_Pos      (21U)
#define RCC_MC_APB4LPENSETR_STGENROSTPEN_Msk      (0x1U << RCC_MC_APB4LPENSETR_STGENROSTPEN_Pos)     /*!< 0x00200000 */
#define RCC_MC_APB4LPENSETR_STGENROSTPEN          RCC_MC_APB4LPENSETR_STGENROSTPEN_Msk               /*!< STGEN Read-Only Interface, clock enable during CStop mode */

