ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151fxx_cm4.h
/*******************  Bit definition for RCC_VERR register  *******************/
#define RCC_VERR_MINREV_Pos                       (0U)
#define RCC_VERR_MINREV_Msk                       (0xFU << RCC_VERR_MINREV_Pos)                      /*!< 0x0000000F */
#define RCC_VERR_MINREV                           RCC_VERR_MINREV_Msk                                /*!< Minor Revision of the IP */
#define RCC_VERR_MINREV_0                         (0x1U << RCC_VERR_MINREV_Pos)                      /*!< 0x00000001 */
#define RCC_VERR_MINREV_1                         (0x2U << RCC_VERR_MINREV_Pos)                      /*!< 0x00000002 */
#define RCC_VERR_MINREV_2                         (0x4U << RCC_VERR_MINREV_Pos)                      /*!< 0x00000004 */
#define RCC_VERR_MINREV_3                         (0x8U << RCC_VERR_MINREV_Pos)                      /*!< 0x00000008 */
#define RCC_VERR_MAJREV_Pos                       (4U)
#define RCC_VERR_MAJREV_Msk                       (0xFU << RCC_VERR_MAJREV_Pos)                      /*!< 0x000000F0 */
#define RCC_VERR_MAJREV                           RCC_VERR_MAJREV_Msk                                /*!< Major Revision of the IP */
#define RCC_VERR_MAJREV_0                         (0x1U << RCC_VERR_MAJREV_Pos)                     /*!< 0x00000010 */
#define RCC_VERR_MAJREV_1                         (0x2U << RCC_VERR_MAJREV_Pos)                     /*!< 0x00000020 */
#define RCC_VERR_MAJREV_2                         (0x4U << RCC_VERR_MAJREV_Pos)                     /*!< 0x00000040 */
#define RCC_VERR_MAJREV_3                         (0x8U << RCC_VERR_MAJREV_Pos)                     /*!< 0x00000080 */

/*******************  Bit definition for RCC_IDR register  ********************/
#define RCC_IDR_ID_Pos                            (0U)
#define RCC_IDR_ID_Msk                            (0xFFFFFFFFU << RCC_IDR_ID_Pos)                    /*!< 0xFFFFFFFF */
#define RCC_IDR_ID                                RCC_IDR_ID_Msk                                     /*!< Identifier of the RCC */
#define RCC_IDR_ID_0                              (0x1U << RCC_IDR_ID_Pos)                           /*!< 0x00000001 */
#define RCC_IDR_ID_1                              (0x2U << RCC_IDR_ID_Pos)                           /*!< 0x00000002 */
#define RCC_IDR_ID_2                              (0x4U << RCC_IDR_ID_Pos)                           /*!< 0x00000004 */
#define RCC_IDR_ID_3                              (0x8U << RCC_IDR_ID_Pos)                           /*!< 0x00000008 */
#define RCC_IDR_ID_4                              (0x10U << RCC_IDR_ID_Pos)                          /*!< 0x00000010 */
#define RCC_IDR_ID_5                              (0x20U << RCC_IDR_ID_Pos)                          /*!< 0x00000020 */
#define RCC_IDR_ID_6                              (0x40U << RCC_IDR_ID_Pos)                          /*!< 0x00000040 */
#define RCC_IDR_ID_7                              (0x80U << RCC_IDR_ID_Pos)                          /*!< 0x00000080 */
#define RCC_IDR_ID_8                              (0x100U << RCC_IDR_ID_Pos)                         /*!< 0x00000100 */
#define RCC_IDR_ID_9                              (0x200U << RCC_IDR_ID_Pos)                         /*!< 0x00000200 */
#define RCC_IDR_ID_10                             (0x400U << RCC_IDR_ID_Pos)                         /*!< 0x00000400 */
#define RCC_IDR_ID_11                             (0x800U << RCC_IDR_ID_Pos)                         /*!< 0x00000800 */
#define RCC_IDR_ID_12                             (0x1000U << RCC_IDR_ID_Pos)                        /*!< 0x00001000 */
#define RCC_IDR_ID_13                             (0x2000U << RCC_IDR_ID_Pos)                        /*!< 0x00002000 */
#define RCC_IDR_ID_14                             (0x4000U << RCC_IDR_ID_Pos)                        /*!< 0x00004000 */
#define RCC_IDR_ID_15                             (0x8000U << RCC_IDR_ID_Pos)                        /*!< 0x00008000 */
#define RCC_IDR_ID_16                             (0x10000U << RCC_IDR_ID_Pos)                       /*!< 0x00010000 */
#define RCC_IDR_ID_17                             (0x20000U << RCC_IDR_ID_Pos)                       /*!< 0x00020000 */
#define RCC_IDR_ID_18                             (0x40000U << RCC_IDR_ID_Pos)                       /*!< 0x00040000 */
#define RCC_IDR_ID_19                             (0x80000U << RCC_IDR_ID_Pos)                       /*!< 0x00080000 */
#define RCC_IDR_ID_20                             (0x100000U << RCC_IDR_ID_Pos)                      /*!< 0x00100000 */
#define RCC_IDR_ID_21                             (0x200000U << RCC_IDR_ID_Pos)                      /*!< 0x00200000 */
#define RCC_IDR_ID_22                             (0x400000U << RCC_IDR_ID_Pos)                      /*!< 0x00400000 */
#define RCC_IDR_ID_23                             (0x800000U << RCC_IDR_ID_Pos)                      /*!< 0x00800000 */
#define RCC_IDR_ID_24                             (0x1000000U << RCC_IDR_ID_Pos)                     /*!< 0x01000000 */
#define RCC_IDR_ID_25                             (0x2000000U << RCC_IDR_ID_Pos)                     /*!< 0x02000000 */
#define RCC_IDR_ID_26                             (0x4000000U << RCC_IDR_ID_Pos)                     /*!< 0x04000000 */
#define RCC_IDR_ID_27                             (0x8000000U << RCC_IDR_ID_Pos)                     /*!< 0x08000000 */
#define RCC_IDR_ID_28                             (0x10000000U << RCC_IDR_ID_Pos)                    /*!< 0x10000000 */
#define RCC_IDR_ID_29                             (0x20000000U << RCC_IDR_ID_Pos)                    /*!< 0x20000000 */
#define RCC_IDR_ID_30                             (0x40000000U << RCC_IDR_ID_Pos)                    /*!< 0x40000000 */
#define RCC_IDR_ID_31                             (0x80000000U << RCC_IDR_ID_Pos)                    /*!< 0x80000000 */

/*******************  Bit definition for RCC_SIDR register  *******************/
#define RCC_SIDR_SID_Pos                          (0U)
#define RCC_SIDR_SID_Msk                          (0xFFFFFFFFU << RCC_SIDR_SID_Pos)                  /*!< 0xFFFFFFFF */
#define RCC_SIDR_SID                              RCC_SIDR_SID_Msk                                   /*!< Decoding space is 4 kbytes */
#define RCC_SIDR_SID_0                            (0x1U << RCC_SIDR_SID_Pos)                         /*!< 0x00000001 */
#define RCC_SIDR_SID_1                            (0x2U << RCC_SIDR_SID_Pos)                         /*!< 0x00000002 */
#define RCC_SIDR_SID_2                            (0x4U << RCC_SIDR_SID_Pos)                         /*!< 0x00000004 */
#define RCC_SIDR_SID_3                            (0x8U << RCC_SIDR_SID_Pos)                         /*!< 0x00000008 */
#define RCC_SIDR_SID_4                            (0x10U << RCC_SIDR_SID_Pos)                        /*!< 0x00000010 */
#define RCC_SIDR_SID_5                            (0x20U << RCC_SIDR_SID_Pos)                        /*!< 0x00000020 */
#define RCC_SIDR_SID_6                            (0x40U << RCC_SIDR_SID_Pos)                        /*!< 0x00000040 */
#define RCC_SIDR_SID_7                            (0x80U << RCC_SIDR_SID_Pos)                        /*!< 0x00000080 */
#define RCC_SIDR_SID_8                            (0x100U << RCC_SIDR_SID_Pos)                       /*!< 0x00000100 */
#define RCC_SIDR_SID_9                            (0x200U << RCC_SIDR_SID_Pos)                       /*!< 0x00000200 */
#define RCC_SIDR_SID_10                           (0x400U << RCC_SIDR_SID_Pos)                       /*!< 0x00000400 */
#define RCC_SIDR_SID_11                           (0x800U << RCC_SIDR_SID_Pos)                       /*!< 0x00000800 */
#define RCC_SIDR_SID_12                           (0x1000U << RCC_SIDR_SID_Pos)                      /*!< 0x00001000 */
#define RCC_SIDR_SID_13                           (0x2000U << RCC_SIDR_SID_Pos)                      /*!< 0x00002000 */
#define RCC_SIDR_SID_14                           (0x4000U << RCC_SIDR_SID_Pos)                      /*!< 0x00004000 */
#define RCC_SIDR_SID_15                           (0x8000U << RCC_SIDR_SID_Pos)                      /*!< 0x00008000 */
#define RCC_SIDR_SID_16                           (0x10000U << RCC_SIDR_SID_Pos)                     /*!< 0x00010000 */
#define RCC_SIDR_SID_17                           (0x20000U << RCC_SIDR_SID_Pos)                     /*!< 0x00020000 */
#define RCC_SIDR_SID_18                           (0x40000U << RCC_SIDR_SID_Pos)                     /*!< 0x00040000 */
#define RCC_SIDR_SID_19                           (0x80000U << RCC_SIDR_SID_Pos)                     /*!< 0x00080000 */
#define RCC_SIDR_SID_20                           (0x100000U << RCC_SIDR_SID_Pos)                    /*!< 0x00100000 */
#define RCC_SIDR_SID_21                           (0x200000U << RCC_SIDR_SID_Pos)                    /*!< 0x00200000 */
#define RCC_SIDR_SID_22                           (0x400000U << RCC_SIDR_SID_Pos)                    /*!< 0x00400000 */
#define RCC_SIDR_SID_23                           (0x800000U << RCC_SIDR_SID_Pos)                    /*!< 0x00800000 */
#define RCC_SIDR_SID_24                           (0x1000000U << RCC_SIDR_SID_Pos)                   /*!< 0x01000000 */
#define RCC_SIDR_SID_25                           (0x2000000U << RCC_SIDR_SID_Pos)                   /*!< 0x02000000 */
#define RCC_SIDR_SID_26                           (0x4000000U << RCC_SIDR_SID_Pos)                   /*!< 0x04000000 */
#define RCC_SIDR_SID_27                           (0x8000000U << RCC_SIDR_SID_Pos)                   /*!< 0x08000000 */
#define RCC_SIDR_SID_28                           (0x10000000U << RCC_SIDR_SID_Pos)                  /*!< 0x10000000 */
#define RCC_SIDR_SID_29                           (0x20000000U << RCC_SIDR_SID_Pos)                  /*!< 0x20000000 */
#define RCC_SIDR_SID_30                           (0x40000000U << RCC_SIDR_SID_Pos)                  /*!< 0x40000000 */
#define RCC_SIDR_SID_31                           (0x80000000U << RCC_SIDR_SID_Pos)                  /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)
#define RNG_CR_RNGEN_Msk    (0x1U << RNG_CR_RNGEN_Pos)                         /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk
#define RNG_CR_IE_Pos       (3U)
#define RNG_CR_IE_Msk       (0x1U << RNG_CR_IE_Pos)                            /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk
#define RNG_CR_CED_Pos      (5U)
#define RNG_CR_CED_Msk      (0x1U << RNG_CR_CED_Pos)                           /*!< 0x00000020 */
#define RNG_CR_CED          RNG_CR_CED_Msk

